
## Plan Result (aat)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_private_endpoint.ped_web_pubsub_private_endpoint
  * azurerm_web_pubsub_network_acl.ped_web_pubsub_network_acl
* Update
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_endpoint.ped_web_pubsub_private_endpoint will be created
  + resource "azurerm_private_endpoint" "ped_web_pubsub_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "em-icp-aat-privateendpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "cft-aat-network-rg"
      + subnet_id                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/private-endpoints"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "em-icp-aat-service-connection"
          + private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-aat"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "webpubsub",
            ]
        }
    }

  # azurerm_web_pubsub_network_acl.ped_web_pubsub_network_acl will be created
  + resource "azurerm_web_pubsub_network_acl" "ped_web_pubsub_network_acl" {
      + default_action = "Allow"
      + id             = (known after apply)
      + web_pubsub_id  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-aat"

      + private_endpoint {
          + allowed_request_types = []
          + denied_request_types  = []
          + id                    = (known after apply)
        }

      + public_network {}
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Cache/redis/em-icp-redis-cache-aat"
        name                               = "em-icp-redis-cache-aat"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (13 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1452,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->